SengPhirum/PLXY_DrowsyGuard/firmware/esp32s3/sdkconfig.defaults
# Baseline config for the ESP32-S3-WROOM-1 N16R8 CAM board.
# `idf.py set-target esp32s3` seeds sdkconfig from this file. Delete sdkconfig (not
# this file) if you want to start over.

CONFIG_IDF_TARGET="esp32s3"

# --- 16 MB flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 8 MB octal PSRAM ---
# Non-negotiable: the camera framebuffers live here (CAMERA_FB_IN_PSRAM) and so do
# the ESP-DL models. Get MODE_OCT wrong and the board boots but finds 0 bytes of
# PSRAM, which surfaces later as an unexplained esp_camera_init() failure.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- performance ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# --- camera ---
# Three sensors, because the board does not reliably ship the one it is sold as.
# khmeres item 2991 is listed with an OV3660; the unit verified on 2026-08-23
# (MAC 80:b5:4e:c5:e0:18) actually carries an **OV5640** and reports
# "ov3660: Mismatch PID=0x5640" on the way to detecting it correctly. Both are
# pinned here rather than left to the component's defaults: OV5640 happens to
# default to y today, and losing it would look like a dead camera rather than a
# missing driver.
CONFIG_OV3660_SUPPORT=y
CONFIG_OV5640_SUPPORT=y
CONFIG_OV2640_SUPPORT=y
CONFIG_CAMERA_TASK_STACK_SIZE=4096

# --- models ---
# The face detector's weights are linked into the app binary rather than loaded
# from a partition. partitions.csv sizes the app partition at 6 MB for exactly this.
CONFIG_HUMAN_FACE_DETECT_MODEL_IN_FLASH_RODATA=y

# --- Wi-Fi + HTTP preview -------------------------------------------------
# The panel was replaced by a browser, so the radio and the TCP stack are now on
# the critical path for everything a developer or examiner can see. These are the
# esp32-camera web-server settings, and they are not optional decoration: with the
# stock buffer counts an MJPEG stream stalls for hundreds of milliseconds at a time
# and reads as a camera that cannot keep up.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# TX buffers are STATIC here, and that is forced rather than chosen: ESP-IDF makes
# ESP_WIFI_DYNAMIC_TX_BUFFER unavailable whenever SPIRAM_TRY_ALLOCATE_WIFI_LWIP is
# set (which it is, a few lines up), because dynamic buffers cannot be guaranteed
# once the Wi-Fi stack is allowed into PSRAM. Setting the derived
# CONFIG_ESP_WIFI_TX_BUFFER_TYPE directly does nothing - it is computed from the
# choice - so the knob that actually matters is the static count below.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=24
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# Two HTTP servers (control on :80, stream on :81), each with a handful of
# sockets, plus the DHCP server for the SoftAP.
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64

# The status JSON is a single ~1 kB response and the query strings are short, but
# a browser's own request headers are not: leave room for them.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# --- app ---
# app_main runs the capture loop directly, and BehaviorAnalyzer/Perclos keep a few
# KB of rolling buffers on the stack path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The camera + LCD current spike on a marginal USB cable trips the brownout
# detector mid-init. Lower the threshold rather than chasing phantom camera faults;
# raise it back for the final power-supply validation.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4=y

# --- MQTT alerting --------------------------------------------------------
# esp-mqtt ships with ESP-IDF, but three of the four transports this feature
# offers are behind Kconfig options that default to off, and a transport that is
# compiled out fails at connect time with a generic transport error rather than
# "not built" - which is a long afternoon.
#
# WebSocket is not a nicety here: the documentation's fleet page is a browser, and
# a browser cannot open a raw MQTT socket at all. WSS is what a page served over
# HTTPS is *required* to use, so both halves have to be in.
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y

# MQTT 5 is offered as a choice in the settings modal, so it has to be compiled
# in; the default protocol is still 3.1.1, which every broker speaks.
CONFIG_MQTT_PROTOCOL_5=y

# The outbox is esp-mqtt's own QoS 1 retransmission buffer, underneath our
# 16-event MqttOutbox. 8 kB is roughly twenty alert payloads in flight, which is
# more than the 16 our own buffer will ever hand over at once.
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=30000
CONFIG_MQTT_CUSTOM_OUTBOX=n

# The Mozilla root bundle, in flash. This is what makes the preconfigured public
# broker reachable over TLS *with* server verification and no certificate pasted
# in - the alternative is shipping a default that only works with verification
# switched off, which is how "TLS" quietly becomes "encrypted to somebody".
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# One more socket than before: the MQTT client holds one whenever it is connected,
# on top of the two HTTP servers and the DHCP server.
CONFIG_LWIP_MAX_SOCKETS=20

# SNTP is not enabled and the payload says so. There is no RTC on this board, so a
# device that has never reached a time server publishes "ts":"" and
# "ts_source":"uptime" rather than a timestamp in 1970 - see
# mqtt_config.cpp:mqtt_iso8601(). uptime_ms is always present and is what the
# fleet page orders events by.
